{
    "name" : "Range Reserver Connect",
    "version" : "0.16.1",
    "author" : "Mohamad Kabalan",
    "download_url" : "",
    "sections" : {
        "description" : "Connect Range Reserver with third party services like Google calendar, Twilio, iCal, WooCommerce etc.",
        "changelog" : "<h1>0.16.1</h1><p>Changed way of embedding PayPal code into page to resolve issues with themes like Twenty Twenty-Two</p><h1>0.15.4</h1><p>Fixed issue with WooCommerce checkout that fails with error.</p><h1>0.15.3</h1><p>Fixed issue with paypal button and php warning notification.</p><p>Fixed issue with PHP8 and Google Calendar</p><h1>0.15.1</h1><p>PayPal: added option to customize switch label for selecting pay via paypal or pay in store</p><h1>0.15.0</h1><p>Added new SMS provider (OMNICOM) and Mail reminders if you want to send mails instead of SMS messages</p><h1>0.14.0</h1><p>Twilio Added Follow Up template SMS</p><h1>0.13.3</h1><p>PayPal prevent payment before validating Google reCaptcha</p><h1>0.13.2</h1><p>Fixed issue with missing PayPal button</p><h1>0.13.1</h1><p>Fixed issue with PHP Warning message.</p><h1>0.13.0</h1><p>PayPal: Added option for Smart button payment.</p><h1>0.12.5</h1><p>Google Calendar: Now every email from appointment will be added as attendee to Google Calendar meeting</p><h1>0.12.4</h1><p>Google Calendar > Added action link tags for google calendar subject and description sync</p><p>Google Calendar: fixed issue with empty name on sync back from Google Calendar</p><h1>0.12.3</h1><p>WooCommerce: fixed issue with fatal error.</p><h1>0.12.1</h1><p>Google Sync: Added option to copy previous field values when fetching new Events created on Google Calendar based on matching email with current EA bookings.</p><h1>0.12.0</h1><p>Fixed issue with price override with default value during sync with Google Calendar.</p><p>Fixed conflict issues with other plugins that used different version of Google SDK (SMTP Plugin etc)</p><h1>0.11.9</h1><p>Added option for Description field inside Google Calendar settings. Now you can customize description of events.</p><h1>0.11.8</h1><p>Updated dependencies</p><h1>0.11.7</h1><p>Added new option for settings timezone inside ICS file for email</p><h1>0.11.6</h1><p>Added Indian rupee to PayPal Currency list</p><h1>0.11.5</h1><p>Small fix regarding PayPal.</p><h1>0.11.4</h1><p>Fixed issue with PayPal script and tags</p><p>Fixed issue with SMS and timezone values for appointment start and end time.</p><h1>0.11.3</h1><p>Improvements regarding ICS date time formatting.</p><h1>0.11.1</h1><p>Added select for Payment method when PayPal checkout is not mandatory.</p><h1>0.11.0</h1><p>Update for WooCommerce integration. Fixed issue with status change before payment.</p><h1>0.10.11</h1><p>Fix for JPY currency and PayPal</p><p>Style improvements</p><h1>0.10.10</h1><p>Fix for remove Appointment error during EA Sync from Google Calendar</p><h1>0.10.9</h1><p>Removed debug log</p><h1>0.10.8</h1><p>Added support for Google Calendar all-day events sync.</p><h1>0.10.7</h1><p>Fixed issue with SMS reminder message and status issue. Now SMS reminder will only be triggered by confirmed appointments.</p><h1>0.10.4</h1><p>New Feature: Twilio SMS Limit per month option.</p><h1>0.10.3</h1><p>New Feature: Twilio SMS Template for reminder. Now there is a custom template for reminder, if it's empty and reminder is set. Confirmed reminder template will be used instead.</p><h1>0.10.2</h1><p>Fixed issue with missing data for Google Calendar events</p><h1>0.10.1</h1><p>Fixed issue with Google Calendar sync and duplication of some Google Events.</p><h1>0.10.0</h1><p>Google Calendar sync improvements. Now deleting event from Google Calendar will trigger customer mail notification after sync.</p><p>PayPal: added option for checkout button style.</p><h1>0.9.12</h1><p>PayPal: Allow buyers to pay with their credit or debit card (Visa, Mastercard, American Express, Discover, and so on) OPTION.</p><h1>0.9.11</h1><p>Fixed issue with SMS reminder.</p><h1>0.9.10</h1><p>Fixed issue with Missing third param inside Error</p><h1>0.9.9</h1><p>Fixed Issue with missing Twilio files</p><h1>0.9.8</h1><p>Fixed issue with PayPal button and form validation. Also fixed issue with $0 services and PayPal error.</p><h1>0.9.7</h1><p>Fixed issue with Twilio <code>send to</code> field that didn't show saved value.</p><h1>0.9.6</h1><p>Fixed issue with short term token instead of long term token for Google authorization</p><h1>0.9.5</h1><p>Twilio: Added country code prefix field.</p><p>Fixed issue with WordPress located inside sub-folder.</p><h1>0.9.4</h1><p>Added sync for Google Events that are lasting for more then one day.</p><h1>0.9.3</h1><p>Improved class loading for vendor libs.</p><h1>0.9.2</h1><p>Added option for adding ICS attachment in Admin email notifications</p><p>Fixed issue with ICS file path</p><h1>0.9.1</h1><p>Fixed issue with SSL and Google Authorization</p><h4>0.9.0</h4><p>Improved WooCommerce - now when customer finish creation of the order it will automatically change status from pending to confirmed for that Appointments</p><p>Added date/time formatting for Twilio SMS notifications</p><h4>0.8.5</h4><p>Fixed issue with ICS file generation.</p><h4>0.8.4</h4><p>NEW - PayPal not required payment option</p><p>Small bug fixes</p><h4>0.8.3</h4><p>Bug fix regarding Google Calendar events that keep syncing multiple times</p><p>Sync process improvements.</p><h4>0.8.2</h4><p>Bug fix for Google Calendar sync. There was a bug that was only showing on large number of sync events. Please update</p><h4>0.8.0</h4> <p>Added PayPal support</p><p>Google Calendar - turn on/off usage of customers email while creating Event in Google Calendar as attendee</p> <h4>0.7.5</h4> <p>Polylang bugfix issue</p> <h4>0.7.4</h4> <p>Small bug fix</p> <h4>0.7.3</h4> <p>Remove Google token fix.</p><h4>0.7.2</h4> <p>Bug fixes, show error notice if google token is not valid etc.</p> <h4>0.7.1</h4> <p>Cron status indicator</p><h4>0.7.0</h4> <p>NEW - Multiple Google Calendars sync option. Now you can set different settings for each Calendar and sync back separate services location and workers.</p> <h4>0.6.3</h4> <p>NEW - iCalendar option. Send ICS along customers email and let them easily add Appointments to their calendars."
    }
}